app/views/events/index.html.erb

        <td><%= event.address %></td>
        <td><%= event.all_tags.map{ |t| link_to t, tag_path(t)}.join(',') %></td>
---
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."event_id" = $1  [["event_id", 1]]