app/controllers/events_controller.rb

  def index
    if params[:tag]
      @events = Event.tagged_with(params[:tag])
    else
      @events = Event.all
---
SELECT "events".* FROM "events"
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."event_id" = $1  [["event_id", 1]]

  def create
    @event = current_user.organized_events.new(event_params)

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("title", "location", "agenda", "address", "start_date", "end_date", "organizer_id", "slug", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"