app/controllers/recipes_controller.rb

  def create
    @recipe = Recipe.new(recipe_params)

    respond_to do |format|
      if @recipe.save
---
INSERT INTO "recipes" ("title", "cooking_time", "difficulty_level", "food_type_id", "food_preference_id", "cuisine_id", "ingredients", "procedure", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"